name: "f5tts"
backend: "python"
max_batch_size: 8

input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [ -1 ]
  },
  {
    name: "reference_audio"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
  }
]

output [
  {
    name: "audio"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]

parameters [
  {
    key: "EXECUTION_ENV_PATH",
    value: {string_value: "/workspace/F5-TTS"}
  }
] 